cask_args appdir: "/Applications"

tap "heroku/brew"
tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/cask-versions"
# tap "homebrew/core"
tap "sanemat/font"

brew "git"
brew "gitmoji"
brew "git-secrets"
brew "mas"
brew "ricty"
brew "shellcheck"
brew "tree"
brew "volta"
brew "wget"
brew "starship"
brew "rbenv"
brew "ruby-build"
brew "rye"
brew "go"
brew "font-hack-nerd-font"


cask "arc"
cask "discord"
cask "docker"
cask "google-chrome"
cask "karabiner-elements"
cask "raycast"
cask "ngrok"
cask "slack"
cask "the-unarchiver"
cask "visual-studio-code"
cask "warp"
cask "zoom"
cask "linearmouse"
 

mas "LINE", id: 539883307
mas "RunCat", id: 1429033973